Yunan0718/DistillToMCU/sdkconfig.defaults
# DistillToMCU SDK defaults
CONFIG_IDF_TARGET="esp32s3"
# v6 security fix: real credentials live in local sdkconfig.user (gitignored).
# Copy sdkconfig.user.example -> sdkconfig.user and fill in real values.
# NOTE: keep this file pure ASCII (kconfgen reads it with system locale).
CONFIG_MIMI_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_MIMI_WIFI_PASS="YOUR_WIFI_PASS"
CONFIG_MIMI_API_KEY="sk-placeholder"

# v6: onboard WS2812 initialized only to send one OFF frame at boot,
# clearing the latched color; mirroring is disabled (not needed for the paper).
# NOTE: keep this file pure ASCII (kconfgen reads it with system locale).
CONFIG_MIMI_LED_WS2812_ENABLE=y
CONFIG_MIMI_LED_WS2812_MIRROR=n

# ===== CPU =====
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ===== Flash =====
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# ===== PSRAM (8MB Octal) =====
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_MEMTEST=n

# ===== WiFi memory optimization =====
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# ===== TLS: allocate to PSRAM (fixes SSL_SETUP_FAILED crash) =====
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# ===== WebSocket server support (for dashboard) =====
CONFIG_HTTPD_WS_SUPPORT=y

# ===== SPIFFS =====
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# ===== FreeRTOS dual-core =====
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_NUMBER_OF_CORES=2

# ===== Console: USB Serial/JTAG (allows REPL input via USB) =====
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ===== Partition table =====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ===== WiFi =====
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
CONFIG_LWIP_LOCAL_HOSTNAME="distilltomcu"
